using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace selection_committee.Constants
{
    public static class EntrantComboBoxLists
    {
        public static readonly List<string> YesNo = new List<string>() { "Да", "Нет" };
        public static readonly List<string> Genders = new List<string>() { "Мужской", "Женский" };
        public static readonly List<string> Citizenship = new List<string>() { "Россия", "Страны СНГ", "Другое" };
        public static readonly List<string> Variants9Or11Years = new List<string>()
        {
            "Только 9 классов",
            "Только 11 классов",
            "Другое"
        };
        public static readonly List<string> Speciality = new List<string>()
        {
            "Архитектура",
            "Гидрогеология и инженерная геология",
            "Информационные системы и программирование (на базе 9 классов)",
            "Строительство и эксплуатация зданий и сооружений (на базе 9 классов)",
            "Разработка электронных устройств и систем",
            "Информационные системы и программирование (на базе 11 классов)",
            "Строительство и эксплуатация зданий и сооружений (на базе 11 классов)"
        };
        public static readonly List<string> Subject = new List<string>
        {
            "Республика Адыгея", "Республика Башкортостан", "Республика Бурятия",
            "Республика Алтай", "Республика Дагестан", "Республика Ингушетия",
            "Кабардино-Балкарская Республика", "Республика Калмыкия",
            "Карачаево-Черкесская Республика", "Республика Карелия",
            "Республика Коми", "Республика Крым", "Республика Марий Эл",
            "Республика Мордовия",
            "Республика Саха (Якутия)",
            "Республика Северная Осетия - Алания",
            "Республика Татарстан", "Республика Тыва",
            "Удмуртская Республика", "Республика Хакасия",
            "Чеченская Республика", "Чувашская Республика",
            "Алтайский край", "Краснодарский край",
            "Красноярский край", "Приморский край",
            "Ставропольский край", "Хабаровский край",
            "Амурская область", "Архангельская область",
            "Астраханская область","Белгородская область",
            "Брянская область","Владимирская область","Волгоградская область",
            "Вологодская область","Воронежская область",
            "Ивановская область","Иркутская область",
            "Калининградская область","Калужская область",
            "Кемеровская область","Кировская область",
            "Костромская область","Курганская область",
            "Курская область","Ленинградская область",
            "Липецкая область","Магаданская область",
            "Московская область","Мурманская область",
            "Нижегородская область","Новгородская область",
            "Новосибирская область","Омская область",
            "Оренбургская область","Орловская область",
            "Пензенская область","Пермский край",
            "Псковская область","Ростовская область",
            "Рязанская область","Самарская область",
            "Саратовская область","Сахалинская область",
            "Свердловская область","Смоленская область",
            "Тамбовская область","Тверская область","Томская область",
            "Тульская область",
            "Тюменская область","Ульяновская область","Челябинская область",
            "Ярославская область","г. Москва","г. Санкт-Петербург","Еврейская автономная область",
            "Ненецкий автономный округ","Ханты-Мансийский автономный округ - Югра",
            "Чукотский автономный округ","Ямало-Ненецкий автономный округ"
        };
        public static readonly List<string> District = new List<string>()
        {
            "Антроповский район", "Буйский район", "Вохомский район",
            "Галичский район", "Кадыйский район",
            "Костромской район","Красносельский район", "Макарьевский район",
            "Нейский округ","Нерехтский район","Октябрьский район", "Островский район",
            "Павинский район", "Поназыревский район",
            "Пыщугский район", "Солигаличский район", "Судиславский район", "Сусанинский район",
            "Чухломский район", "Шарьинский район","г. Буй","г. Волгореченск",
            "г. Галич","г. Кострома", "г. Мантурово",  "город Шарья", "Кологривский округ",
            "Межевской округ", "Парфеньевский округ"
        };
        public static readonly List<string> StudyBasedList = new List<string>() {
            "Бюджет",
            "На основе договора об оказании плантых услуг"
        };
    }
}
